data/fio/RHEL6.7/4k/Buffered_RandWrite.log
thread-1: (g=0): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
thread-2: (g=1): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
...
thread-4: (g=2): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
...
thread-8: (g=3): rw=randwrite, bs=4K-4K/4K-4K/4K-4K, ioengine=sync, iodepth=1
...
fio-2.2.9
Starting 15 processes

thread-1: (groupid=0, jobs=1): err= 0: pid=5699: Tue Oct 27 21:09:03 2015
  write: io=4096.0MB, bw=24479KB/s, iops=6119, runt=171345msec
    clat (usec): min=2, max=727095, avg=120.03, stdev=5634.12
     lat (usec): min=2, max=727095, avg=120.13, stdev=5634.12
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    4], 60.00th=[    4],
     | 70.00th=[    4], 80.00th=[    4], 90.00th=[    5], 95.00th=[    5],
     | 99.00th=[    7], 99.50th=[    8], 99.90th=[   14], 99.95th=[63232],
     | 99.99th=[325632]
    bw (KB  /s): min= 5595, max=815528, per=100.00%, avg=36135.54, stdev=112376.13
    lat (usec) : 4=42.09%, 10=57.67%, 20=0.18%, 50=0.01%, 100=0.01%
    lat (msec) : 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%
    lat (msec) : 250=0.04%, 500=0.01%, 750=0.01%
  cpu          : usr=0.74%, sys=2.70%, ctx=18386, majf=0, minf=40
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=1048576/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-2: (groupid=1, jobs=1): err= 0: pid=5728: Tue Oct 27 21:09:03 2015
  write: io=2048.0MB, bw=9341.4KB/s, iops=2335, runt=224503msec
    clat (usec): min=2, max=1544.5K, avg=332.28, stdev=14960.67
     lat (usec): min=2, max=1544.5K, avg=332.39, stdev=14960.67
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    4], 60.00th=[    4],
     | 70.00th=[    4], 80.00th=[    4], 90.00th=[    5], 95.00th=[    5],
     | 99.00th=[    7], 99.50th=[    8], 99.90th=[   20], 99.95th=[226304],
     | 99.99th=[913408]
    bw (KB  /s): min=   11, max=590480, per=70.95%, avg=13254.93, stdev=44963.58
    lat (usec) : 4=42.20%, 10=57.47%, 20=0.24%, 50=0.02%, 100=0.01%
    lat (msec) : 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%, 250=0.03%
    lat (msec) : 500=0.02%, 750=0.01%, 1000=0.01%, 2000=0.01%
  cpu          : usr=0.29%, sys=1.36%, ctx=18173, majf=0, minf=39
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=524288/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-2: (groupid=1, jobs=1): err= 0: pid=5729: Tue Oct 27 21:09:03 2015
  write: io=2048.0MB, bw=9526.9KB/s, iops=2381, runt=220131msec
    clat (usec): min=2, max=2024.9K, avg=325.12, stdev=13882.52
     lat (usec): min=2, max=2024.9K, avg=325.23, stdev=13882.52
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    4], 60.00th=[    4],
     | 70.00th=[    4], 80.00th=[    4], 90.00th=[    5], 95.00th=[    5],
     | 99.00th=[    7], 99.50th=[    8], 99.90th=[   22], 99.95th=[226304],
     | 99.99th=[765952]
    bw (KB  /s): min=   26, max=510432, per=73.00%, avg=13637.56, stdev=44597.79
    lat (usec) : 4=41.66%, 10=58.00%, 20=0.23%, 50=0.03%, 100=0.01%
    lat (usec) : 250=0.01%
    lat (msec) : 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%
    lat (msec) : 250=0.02%, 500=0.03%, 750=0.01%, 1000=0.01%, 2000=0.01%
    lat (msec) : >=2000=0.01%
  cpu          : usr=0.29%, sys=1.31%, ctx=16276, majf=0, minf=40
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=524288/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-4: (groupid=2, jobs=1): err= 0: pid=5775: Tue Oct 27 21:09:03 2015
  write: io=1024.0MB, bw=4515.8KB/s, iops=1128, runt=232204msec
    clat (usec): min=2, max=2823.1K, avg=665.93, stdev=30443.05
     lat (usec): min=2, max=2823.1K, avg=666.04, stdev=30443.05
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    4], 60.00th=[    4],
     | 70.00th=[    4], 80.00th=[    4], 90.00th=[    4], 95.00th=[    5],
     | 99.00th=[    7], 99.50th=[    8], 99.90th=[  302], 99.95th=[391168],
     | 99.99th=[1826816]
    bw (KB  /s): min=   16, max=385101, per=50.37%, avg=9051.90, stdev=31993.10
    lat (usec) : 4=46.01%, 10=53.66%, 20=0.22%, 50=0.01%, 100=0.01%
    lat (usec) : 250=0.01%, 500=0.01%
    lat (msec) : 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%
    lat (msec) : 250=0.02%, 500=0.02%, 750=0.01%, 1000=0.01%, 2000=0.02%
    lat (msec) : >=2000=0.01%
  cpu          : usr=0.14%, sys=0.73%, ctx=7877, majf=0, minf=40
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-4: (groupid=2, jobs=1): err= 0: pid=5776: Tue Oct 27 21:09:03 2015
  write: io=1024.0MB, bw=4611.5KB/s, iops=1152, runt=227387msec
    clat (usec): min=2, max=2945.9K, avg=647.72, stdev=30844.24
     lat (usec): min=2, max=2945.9K, avg=647.86, stdev=30844.24
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    4], 60.00th=[    4],
     | 70.00th=[    4], 80.00th=[    4], 90.00th=[    5], 95.00th=[    5],
     | 99.00th=[    7], 99.50th=[    8], 99.90th=[   19], 99.95th=[325632],
     | 99.99th=[1892352]
    bw (KB  /s): min=   11, max=120352, per=37.85%, avg=6802.93, stdev=11181.09
    lat (usec) : 4=43.19%, 10=56.52%, 20=0.19%, 50=0.01%, 100=0.01%
    lat (msec) : 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%, 250=0.02%
    lat (msec) : 500=0.02%, 750=0.01%, 1000=0.01%, 2000=0.01%, >=2000=0.01%
  cpu          : usr=0.13%, sys=0.74%, ctx=7657, majf=0, minf=39
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-4: (groupid=2, jobs=1): err= 0: pid=5777: Tue Oct 27 21:09:03 2015
  write: io=1024.0MB, bw=4645.9KB/s, iops=1161, runt=225702msec
    clat (usec): min=2, max=3635.8K, avg=658.36, stdev=30964.45
     lat (usec): min=2, max=3635.8K, avg=658.47, stdev=30964.44
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    4], 60.00th=[    4],
     | 70.00th=[    4], 80.00th=[    4], 90.00th=[    5], 95.00th=[    5],
     | 99.00th=[    7], 99.50th=[    8], 99.90th=[   16], 99.95th=[325632],
     | 99.99th=[1826816]
    bw (KB  /s): min=    8, max=135823, per=37.34%, avg=6710.61, stdev=12948.65
    lat (usec) : 4=42.48%, 10=57.24%, 20=0.19%, 50=0.01%, 100=0.01%
    lat (usec) : 250=0.01%
    lat (msec) : 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%
    lat (msec) : 250=0.02%, 500=0.02%, 750=0.01%, 1000=0.01%, 2000=0.02%
    lat (msec) : >=2000=0.01%
  cpu          : usr=0.14%, sys=0.76%, ctx=7577, majf=0, minf=41
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-4: (groupid=2, jobs=1): err= 0: pid=5778: Tue Oct 27 21:09:03 2015
  write: io=1024.0MB, bw=4493.2KB/s, iops=1123, runt=233379msec
    clat (usec): min=2, max=3124.6K, avg=676.44, stdev=32457.30
     lat (usec): min=2, max=3124.6K, avg=676.54, stdev=32457.30
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    4], 60.00th=[    4],
     | 70.00th=[    4], 80.00th=[    4], 90.00th=[    4], 95.00th=[    5],
     | 99.00th=[    7], 99.50th=[    8], 99.90th=[   16], 99.95th=[325632],
     | 99.99th=[1859584]
    bw (KB  /s): min=   10, max=114743, per=33.27%, avg=5980.02, stdev=11212.74
    lat (usec) : 4=42.82%, 10=56.92%, 20=0.17%, 50=0.01%, 100=0.01%
    lat (usec) : 250=0.01%, 500=0.01%
    lat (msec) : 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%, 250=0.02%
    lat (msec) : 500=0.01%, 750=0.01%, 1000=0.01%, 2000=0.02%, >=2000=0.01%
  cpu          : usr=0.14%, sys=0.76%, ctx=8698, majf=0, minf=38
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=262144/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-8: (groupid=3, jobs=1): err= 0: pid=5818: Tue Oct 27 21:09:03 2015
  write: io=524288KB, bw=2304.2KB/s, iops=576, runt=227542msec
    clat (usec): min=2, max=6719.3K, avg=1325.38, stdev=64226.68
     lat (usec): min=2, max=6719.3K, avg=1325.48, stdev=64226.68
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    4], 60.00th=[    4],
     | 70.00th=[    4], 80.00th=[    4], 90.00th=[    4], 95.00th=[    5],
     | 99.00th=[    7], 99.50th=[    9], 99.90th=[10048], 99.95th=[428032],
     | 99.99th=[3555328]
    bw (KB  /s): min=    9, max=195050, per=35.47%, avg=6537.94, stdev=23092.65
    lat (usec) : 4=47.17%, 10=52.38%, 20=0.28%, 50=0.01%, 100=0.01%
    lat (usec) : 250=0.02%, 500=0.03%
    lat (msec) : 4=0.01%, 10=0.01%, 20=0.02%, 50=0.01%, 100=0.01%
    lat (msec) : 250=0.01%, 500=0.02%, 750=0.01%, 1000=0.01%, 2000=0.01%
    lat (msec) : >=2000=0.03%
  cpu          : usr=0.07%, sys=0.42%, ctx=5116, majf=0, minf=39
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=131072/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-8: (groupid=3, jobs=1): err= 0: pid=5819: Tue Oct 27 21:09:03 2015
  write: io=524288KB, bw=2364.3KB/s, iops=591, runt=221756msec
    clat (usec): min=2, max=4744.9K, avg=1268.83, stdev=56263.21
     lat (usec): min=2, max=4744.9K, avg=1269.01, stdev=56263.21
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    4], 60.00th=[    4],
     | 70.00th=[    4], 80.00th=[    4], 90.00th=[    4], 95.00th=[    5],
     | 99.00th=[    7], 99.50th=[    9], 99.90th=[62208], 99.95th=[528384],
     | 99.99th=[3227648]
    bw (KB  /s): min=    7, max=214906, per=37.17%, avg=6852.18, stdev=22798.47
    lat (usec) : 4=47.43%, 10=52.16%, 20=0.25%, 50=0.01%, 250=0.01%
    lat (usec) : 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 10=0.01%, 20=0.02%, 50=0.01%, 100=0.01%, 250=0.02%
    lat (msec) : 500=0.03%, 750=0.01%, 1000=0.01%, 2000=0.01%, >=2000=0.03%
  cpu          : usr=0.06%, sys=0.41%, ctx=3925, majf=0, minf=38
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=131072/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-8: (groupid=3, jobs=1): err= 0: pid=5820: Tue Oct 27 21:09:03 2015
  write: io=524288KB, bw=2338.7KB/s, iops=584, runt=224240msec
    clat (usec): min=2, max=7091.6K, avg=1289.23, stdev=65518.14
     lat (usec): min=2, max=7091.6K, avg=1289.39, stdev=65518.14
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    4], 60.00th=[    4],
     | 70.00th=[    4], 80.00th=[    4], 90.00th=[    5], 95.00th=[    5],
     | 99.00th=[    7], 99.50th=[    8], 99.90th=[ 2024], 99.95th=[325632],
     | 99.99th=[3915776]
    bw (KB  /s): min=    5, max=328795, per=48.17%, avg=8878.67, stdev=39392.64
    lat (usec) : 4=41.95%, 10=57.71%, 20=0.20%, 50=0.01%, 100=0.01%
    lat (usec) : 250=0.01%, 500=0.02%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.02%, 500=0.02%, 750=0.01%, 1000=0.01%
    lat (msec) : 2000=0.01%, >=2000=0.03%
  cpu          : usr=0.07%, sys=0.41%, ctx=3738, majf=0, minf=39
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=131072/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-8: (groupid=3, jobs=1): err= 0: pid=5821: Tue Oct 27 21:09:03 2015
  write: io=524288KB, bw=2312.4KB/s, iops=578, runt=226738msec
    clat (usec): min=2, max=5221.8K, avg=1310.21, stdev=62962.64
     lat (usec): min=2, max=5221.8K, avg=1310.32, stdev=62962.64
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    4], 60.00th=[    4],
     | 70.00th=[    4], 80.00th=[    4], 90.00th=[    4], 95.00th=[    5],
     | 99.00th=[    7], 99.50th=[    9], 99.90th=[ 6368], 99.95th=[428032],
     | 99.99th=[3719168]
    bw (KB  /s): min=    8, max=174800, per=38.70%, avg=7134.46, stdev=19708.47
    lat (usec) : 4=49.08%, 10=50.53%, 20=0.24%, 50=0.01%, 100=0.01%
    lat (usec) : 250=0.01%, 500=0.01%, 750=0.01%
    lat (msec) : 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%, 250=0.02%
    lat (msec) : 500=0.02%, 750=0.01%, 1000=0.01%, 2000=0.01%, >=2000=0.03%
  cpu          : usr=0.06%, sys=0.41%, ctx=4099, majf=0, minf=39
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=131072/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-8: (groupid=3, jobs=1): err= 0: pid=5822: Tue Oct 27 21:09:03 2015
  write: io=524288KB, bw=2341.7KB/s, iops=585, runt=223900msec
    clat (usec): min=2, max=6323.1K, avg=1290.29, stdev=65484.85
     lat (usec): min=2, max=6323.1K, avg=1290.57, stdev=65484.87
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    4], 60.00th=[    4],
     | 70.00th=[    4], 80.00th=[    4], 90.00th=[    5], 95.00th=[    5],
     | 99.00th=[    7], 99.50th=[    8], 99.90th=[  426], 99.95th=[428032],
     | 99.99th=[3784704]
    bw (KB  /s): min=    6, max=330912, per=46.78%, avg=8622.10, stdev=38810.71
    lat (usec) : 4=41.83%, 10=57.80%, 20=0.21%, 50=0.02%, 100=0.01%
    lat (usec) : 250=0.01%, 500=0.03%, 750=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2000=0.01%, >=2000=0.03%
  cpu          : usr=0.08%, sys=0.41%, ctx=3766, majf=0, minf=38
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=131072/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-8: (groupid=3, jobs=1): err= 0: pid=5823: Tue Oct 27 21:09:03 2015
  write: io=524288KB, bw=2418.9KB/s, iops=604, runt=216820msec
    clat (usec): min=2, max=5024.2K, avg=1265.14, stdev=62442.84
     lat (usec): min=2, max=5024.2K, avg=1265.24, stdev=62442.84
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    4], 50.00th=[    4], 60.00th=[    4],
     | 70.00th=[    4], 80.00th=[    4], 90.00th=[    5], 95.00th=[    5],
     | 99.00th=[    7], 99.50th=[    8], 99.90th=[  290], 99.95th=[226304],
     | 99.99th=[3489792]
    bw (KB  /s): min=    7, max=505216, per=58.60%, avg=10802.37, stdev=63439.60
    lat (usec) : 4=37.74%, 10=61.90%, 20=0.21%, 50=0.02%, 100=0.01%
    lat (usec) : 250=0.02%, 500=0.02%, 750=0.01%
    lat (msec) : 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%, 250=0.01%
    lat (msec) : 500=0.01%, 750=0.01%, 2000=0.01%, >=2000=0.04%
  cpu          : usr=0.06%, sys=0.44%, ctx=3544, majf=0, minf=40
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=131072/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-8: (groupid=3, jobs=1): err= 0: pid=5824: Tue Oct 27 21:09:03 2015
  write: io=524288KB, bw=2313.2KB/s, iops=578, runt=226655msec
    clat (usec): min=2, max=6964.5K, avg=1309.22, stdev=64386.83
     lat (usec): min=2, max=6964.5K, avg=1309.32, stdev=64386.83
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    3], 50.00th=[    4], 60.00th=[    4],
     | 70.00th=[    4], 80.00th=[    4], 90.00th=[    4], 95.00th=[    5],
     | 99.00th=[    7], 99.50th=[    8], 99.90th=[ 8032], 99.95th=[428032],
     | 99.99th=[3686400]
    bw (KB  /s): min=    5, max=181776, per=39.97%, avg=7368.03, stdev=20679.16
    lat (usec) : 4=49.96%, 10=49.71%, 20=0.19%, 50=0.01%, 100=0.01%
    lat (usec) : 250=0.01%, 500=0.02%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.01%, 250=0.02%, 500=0.02%, 750=0.01%, 1000=0.01%
    lat (msec) : 2000=0.01%, >=2000=0.03%
  cpu          : usr=0.07%, sys=0.41%, ctx=4601, majf=0, minf=39
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=131072/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1
thread-8: (groupid=3, jobs=1): err= 0: pid=5825: Tue Oct 27 21:09:03 2015
  write: io=524288KB, bw=2562.2KB/s, iops=640, runt=204639msec
    clat (usec): min=2, max=5793.1K, avg=1191.89, stdev=63413.62
     lat (usec): min=2, max=5793.1K, avg=1192.05, stdev=63413.62
    clat percentiles (usec):
     |  1.00th=[    3],  5.00th=[    3], 10.00th=[    3], 20.00th=[    3],
     | 30.00th=[    3], 40.00th=[    4], 50.00th=[    4], 60.00th=[    4],
     | 70.00th=[    4], 80.00th=[    4], 90.00th=[    5], 95.00th=[    5],
     | 99.00th=[    7], 99.50th=[    9], 99.90th=[  294], 99.95th=[226304],
     | 99.99th=[3686400]
    bw (KB  /s): min=    5, max=527652, per=65.17%, avg=12013.51, stdev=67255.88
    lat (usec) : 4=36.78%, 10=62.82%, 20=0.26%, 50=0.01%, 100=0.01%
    lat (usec) : 250=0.02%, 500=0.03%
    lat (msec) : 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%
    lat (msec) : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%, 2000=0.01%
    lat (msec) : >=2000=0.03%
  cpu          : usr=0.07%, sys=0.44%, ctx=4016, majf=0, minf=39
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=131072/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: io=4096.0MB, aggrb=24478KB/s, minb=24478KB/s, maxb=24478KB/s, mint=171345msec, maxt=171345msec

Run status group 1 (all jobs):
  WRITE: io=4096.0MB, aggrb=18682KB/s, minb=9341KB/s, maxb=9526KB/s, mint=220131msec, maxt=224503msec

Run status group 2 (all jobs):
  WRITE: io=4096.0MB, aggrb=17972KB/s, minb=4493KB/s, maxb=4645KB/s, mint=225702msec, maxt=233379msec

Run status group 3 (all jobs):
  WRITE: io=4096.0MB, aggrb=18433KB/s, minb=2304KB/s, maxb=2562KB/s, mint=204639msec, maxt=227542msec

Disk stats (read/write):
  sdb: ios=15/1926117, merge=0/2268715, ticks=1061/142328585, in_queue=142329486, util=99.77%